Revit 2027 API
DoubleArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DoubleArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As DoubleArrayIterator
public:
virtual DoubleArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> DoubleArrayIterator
override ForwardIterator : unit -> DoubleArrayIterator
Return Value
DoubleArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
DoubleArray Class
Autodesk.Revit.DB Namespace